/******************************************************************************************************************************
debug.js 用于调试

用于进行调试

外部接口：

judgePositiveInteger

******************************************************************************************************************************/


 /******************************************************************************************************
    
    JudgePositiveInteger

    函数功能：用于判断输入是否为正整数，如果是，返回true，不是，返回false（现在5.0可以判断为true,还需进一步验证js
    中5.0是否以整数存储）

    输入：待检测是否为正整数的内容

    输出：是正整数为true，不是正整数为false


 ******************************************************************************************************/

function JudgePositiveInteger(input)
{
	if(typeof input !== "number"){
		return false;
	}
	if(input % 1 !== 0 || input <= 0){
		return false;
	}
	return true;
}